### Terraform `plan` Succeeded for Workspace: `default`
  
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_storage_blob.training_content_blobs["../web_content/404.html"] must be replaced
-/+ resource "azurerm_storage_blob" "training_content_blobs" {
!       access_tier            = "Hot" -> (known after apply)
!       content_md5            = "4a4378d241e1ea9a77798e97d08295ce" -> "c915c1ad3741dd196c2610cde1c9bb99" # forces replacement
!       id                     = "https://tamughtrnrkaiser.blob.core.windows.net/$web/404.html" -> (known after apply)
!       metadata               = {} -> (known after apply)
        name                   = "404.html"
!       url                    = "https://tamughtrnrkaiser.blob.core.windows.net/$web/404.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.training_content_blobs["../web_content/index.html"] must be replaced
-/+ resource "azurerm_storage_blob" "training_content_blobs" {
!       access_tier            = "Hot" -> (known after apply)
!       content_md5            = "9a75f1fd57369d0d28ef287d581b2762" -> "ce87d95f86425cbd56dffbeb6121cc6c" # forces replacement
!       id                     = "https://tamughtrnrkaiser.blob.core.windows.net/$web/index.html" -> (known after apply)
!       metadata               = {} -> (known after apply)
        name                   = "index.html"
!       url                    = "https://tamughtrnrkaiser.blob.core.windows.net/$web/index.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>
  